{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "face_recognition_cnn",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 128, 128, 3],
            "dtype": "float32",
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "activation": "relu",
            "name": "conv2d_1"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "name": "max_pooling2d_1"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "softmax",
            "name": "output"
          }
        }
      ]
    }
  },
  "weightsManifest": []
}



